export default class CarService {
  data = [
    {
      id: 1,
      brand: "Audi",
      model: "RS6",
      startPrice: "3262466",
      currency: "грн",
      power: "600",
      acceleration: "3.6",
      maxSpeed: "305",
      description:
        "Ділова зустріч чи сімейна подорож: обирайте Audi RS 6 Avant. Адже цей динамічний спортивний автомобіль пропонує безкомпромісний дизайн разом з високою придатністю для повсякденної експлуатації. Це любов з першої поїздки.",
    },
    {
      id: 2,
      brand: "Audi",
      model: "S7",
      startPrice: "2490110",
      currency: "грн",
      power: "344",
      acceleration: "5.1",
      maxSpeed: "280",
      description:
        "Елегантний вигляд, динамічна віддача потужності, інтер'єр, оздоблений високоякісними матеріалами - Audi S7 Sportback приваблює зовнішніми та внутрішніми особливостями. Крім того, з нашим спортивним купе ви зможете оцінити новітні технології допомоги водієві та можливості мультимедіа.",
    },
    {
      id: 3,
      brand: "Audi",
      model: "RS e-tron GT",
      startPrice: "4632056",
      currency: "грн",
      power: "600",
      acceleration: "3.3",
      maxSpeed: "240",
      description:
        "Прагнення по-новому інтерпретувати сутність автомобіля помітне, у тому числі, в стриманому дизайні, джерелом натхнення для якого слугувала аеродинамічна досконалість. Прогресивна розкіш виступає рушійним імпульсом, який піднімає емоції від керування на новий рівень. Характерна особливість: емблеми RS із червоним ромбом.",
    },
  ];

  getCars() {
    return new Promise((resolve) => {
      setTimeout(() => resolve(this.data), 800);
    });
  }
}
